app/views/purchases/show.html.erb

<p>Export Details</p>
<% @purchase.exports.each do |export| %>
---
SELECT `exports`.* FROM `exports` WHERE `exports`.`purchase_id` = 2