app/controllers/purchases_controller.rb

  def create
    @purchase = Purchase.new(purchase_params.merge(user_id: current_user.id))
    respond_to do |format|
      if @purchase.save
---
INSERT INTO `purchases` (`GSTIN_UIN`, `EMAIL_ID`, `CIN`, `TELEPHONE_NO`, `PAN`, `FAX`, `REVERSE_CHARGE`, `TRANSPORTATION_MODE`, `INVOICE_NO`, `VEHICLE_NO`, `INVOICE_DATE`, `DATE_OF_SUPPLY`, `STATE`, `PLACE_OF_SUPPLY`, `STATE_CODE`, `BUYER_NAME`, `BUYER_ADDRESS`, `BUYER_GSTIN_UIN`, `BUYER_CIN`, `BUYER_STATE`, `BUYER_STATE_CODE`, `CONSIGNEE_NAME`, `CONSIGNEE_ADDRESS`, `CONSIGNEE_GSTIN_UIN`, `CONSIGNEE_CIN`, `CONSIGNEE_STATE`, `CONSIGNEE_STATE_CODE`, `APPLICATION_NO_FOR_REMOVAL_OF_GOODS`, `APPLICATION_DATE_FOR_REMOVAL_OF_GOODS`, `created_at`, `updated_at`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`) VALUES ('try', '', '', '', '', '', '', '', '', '', '2017-10-20 14:36:00', '2017-10-20 14:36:00', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '2017-10-20 14:36:00', '2017-10-20 14:48:45', '2017-10-20 14:48:45', 'Agile-model.jpg', 'image/jpeg', 62685, '2017-10-20 14:48:07')

  def update
    respond_to do |format|
      if @purchase.update(purchase_params)
---
UPDATE `purchases` SET `photo_file_name` = 'ABFL.jpg', `photo_file_size` = 355835, `photo_updated_at` = '2017-10-20 14:49:44', `updated_at` = '2017-10-20 14:49:45' WHERE `purchases`.`id` = 14

  def destroy
    @purchase.destroy
---
DELETE FROM `purchases` WHERE `purchases`.`id` = 1

    def set_purchase
      @purchase = Purchase.find(params[:id])
---
SELECT  `purchases`.* FROM `purchases` WHERE `purchases`.`id` = 8 LIMIT 1