app/controllers/sales_controller.rb

SELECT `sales`.* FROM `sales` WHERE `sales`.`user_id` = 1
---
  def index
    @sales = current_user.sales
    @saleshasharray = Array.new
    @sales.each do |sale|

SELECT  `sales`.* FROM `sales` WHERE `sales`.`BUYER_GSTIN_UIN` = 'sf' LIMIT 1
---
  def buyergst
    parameter = params[:gst]
    # do something with some_parameter and return the results

    @sale=Sale.find_by BUYER_GSTIN_UIN: parameter.to_s

SELECT `exportsales`.* FROM `exportsales` WHERE `exportsales`.`sale_id` = 4
---
    def download
    book = RubyXL::Parser.parse("#{Rails.root}/public/Sample.xlsx")
    sheet = book.worksheets[0]
    sheet[2][2].change_contents(current_user.company)
    sheet[4][0].change_contents(current_user.address)
    sheet[6][1].change_contents(current_user.email)
    sheet[7][1].change_contents(current_user.gst)
    sheet[8][1].change_contents(@sale.INVOICE_NO)
    sheet[9][1].change_contents(@sale.INVOICE_DATE.strftime("%d/%m/%Y"))
    sheet[16][1].change_contents(@sale.PAN)
    sheet[10][4].change_contents(@sale.REVERSE_CHARGE)
    sheet[17][1].change_contents(@sale.BUYER_GSTIN_UIN)
    sheet[17][6].change_contents(@sale.BUYER_CIN)
    sheet[11][0].change_contents("Bill To: " + @sale.BUYER_NAME + ", "+ @sale.BUYER_ADDRESS)
    sheet[11][5].change_contents("Place of Supply: " + @sale.CONSIGNEE_NAME + ", "+ @sale.CONSIGNEE_ADDRESS)
    sheet[16][6].change_contents(@sale.VEHICLE_NO)
    sheet[6][6].change_contents(current_user.landline)
    sheet[7][6].change_contents(current_user.phone)
    sheet[38][0].change_contents("Bank: "+ current_user.bankname + " , Branch Code: " +current_user.branchcode+" , Account: "+current_user.accountnumber + " , IFSC: "+current_user.ifsccode)
    sheet[44][1].change_contents(current_user.pan)
    sheet[45][1].change_contents(current_user.cin)
    export_sheet_no = 19
    total_amount = 0
    total_discount = 0
    total_SGST = 0
    total_CGST = 0
    total_IGST = 0
    grand_total =0
    @sale.exportsales.each do |e|

INSERT INTO `sales` (`GSTIN_UIN`, `EMAIL_ID`, `CIN`, `TELEPHONE_NO`, `PAN`, `FAX`, `REVERSE_CHARGE`, `TRANSPORTATION_MODE`, `INVOICE_NO`, `VEHICLE_NO`, `INVOICE_DATE`, `STATE`, `PLACE_OF_SUPPLY`, `STATE_CODE`, `BUYER_NAME`, `BUYER_ADDRESS`, `BUYER_GSTIN_UIN`, `BUYER_CIN`, `BUYER_STATE`, `BUYER_STATE_CODE`, `CONSIGNEE_NAME`, `CONSIGNEE_ADDRESS`, `CONSIGNEE_GSTIN_UIN`, `CONSIGNEE_CIN`, `CONSIGNEE_STATE`, `CONSIGNEE_STATE_CODE`, `APPLICATION_NO_FOR_REMOVAL_OF_GOODS`, `APPLICATION_DATE_FOR_REMOVAL_OF_GOODS`, `created_at`, `updated_at`, `user_id`, `comment`, `landline`) VALUES ('123gst', 'vikas@gmail.com', 'CIN123', '9916094019', 'ASSDF12A', '123223', '2332', '2332', '2323432', '2342342', '2018-02-16 06:43:00', 'KA', 'ssdfs', '29', 'Vikas Mehta', 'JP Nagar 5th Phase', '123456789', '987654321', 'KA', '29', 'Anjali Mehta', 'Amet', '122344', '4545656', 'KA', '29', '2345', '2018-02-16 06:43:00', '2018-02-16 07:26:11', '2018-02-16 07:26:11', 3, 'dsfsd', '02633220073')
---
  def create
    @sale = Sale.new(sale_params.merge(user_id: current_user.id))
    respond_to do |format|
      if @sale.save

UPDATE `sales` SET `BUYER_NAME` = 'Vikas Mehta', `BUYER_ADDRESS` = 'Vikas Mehta Vikas MehtaVikas MehtaVikas MehtaVikas MehtaVikas MehtaVikas MehtaVikas MehtaVikas MehtaVikas MehtaVikas MehtaVikas MehtaVikas MehtaVikas MehtaVikas MehtaVikas MehtaVikas MehtaVikas Mehta', `updated_at` = '2018-02-16 06:03:05' WHERE `sales`.`id` = 4
---
  def update
    respond_to do |format|
      if @sale.update(sale_params)

DELETE FROM `sales` WHERE `sales`.`id` = 1
---
  def destroy
    @sale.destroy

SELECT  `sales`.* FROM `sales` WHERE `sales`.`id` = 4 LIMIT 1
---
    def set_sale
      @sale = Sale.find(params[:id])