app/controllers/users_controller.rb

def create
  @user = User.new(user_params)
  if @user.save
---
INSERT INTO `users` (`email`, `password_hash`, `password_salt`, `created_at`, `updated_at`, `company`, `address`, `gst`, `phone`, `bankname`, `branchcode`, `accountnumber`, `ifsccode`, `pan`, `cin`, `landline`) VALUES ('vikass@gmail.com', '$2a$10$OEasx5OMwD.BICX3.pN8OewGgsTx266okQj3NX7vMC6oE54t4cw8q', '$2a$10$OEasx5OMwD.BICX3.pN8Oe', '2018-01-17 12:11:56', '2018-01-17 12:11:56', 'Neuph', 'JP Nagar', '123456', '9916094019', 'HDFC', '239', '00777111', 'HDFC123', '12345dff', 'sds2324', '02622220073')