app/views/sales/show.html.erb

SELECT `exportsales`.* FROM `exportsales` WHERE `exportsales`.`sale_id` = 1
---
<p>Export Details</p>
<% @sale.exportsales.each do |exportsale| %>